#include <stdio.h>

//Напишите программу, печатающую значение EOF.

int main() {
    printf("%d\n", EOF);
    return 0;
}

